#Область ПрограммныйИнтерфейс
Процедура ДоработкаФормы(Форма) Экспорт

    ИмяФормы = Форма.ИмяФормы;
    
    Если ИмяФормы ="Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
        ДобавитьПолеКонтакноеЛицоВГруппаШапкаПраво(Форма);
        ВставитьПолеСогласованнаяСкидка(Форма);
    ИначеЕсли ИмяФормы ="Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
        ВставитьПолеКонтактноеЛицоПередДоговором(Форма);
    ИначеЕсли ИмяФормы ="Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
        ВставитьПолеКонтактноеЛицоПередДоговором(Форма);
    ИначеЕсли ИмяФормы ="Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
        ДобавитьПолеКонтакноеЛицоВГруппаШапкаПраво(Форма);
    ИначеЕсли ИмяФормы ="Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
        ДобавитьПолеКонтакноеЛицоВГруппаШапкаПраво(Форма);
    КонецЕсли;
    
КонецПроцедуры 
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфес 
Процедура ДобавитьПолеКонтакноеЛицоВГруппаШапкаПраво(Форма)
    ПолеВвода = Форма.Элементы.Добавить("КонтакноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
    ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
    ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтакноеЛицо";
КонецПроцедуры
 
Процедура ВставитьПолеКонтактноеЛицоПередДоговором(Форма)
    ПередЭлементом = Форма.Элементы.Найти("Договор");
    ПолеВвода = Форма.Элементы.Вставить("КонтакноеЛицо", Тип("ПолеФормы"), Неопределено, ПередЭлементом);
    ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
    ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтакноеЛицо";
КонецПроцедуры
 
Процедура ВставитьПолеСогласованнаяСкидка(Форма)
    ПолеВвода = Форма.Элементы.Вставить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
    ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
    ПолеВвода.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
    ПолеВвода.УстановитьДействие("ПриИзменении","СогласованнаяСкидкаПриИзменении");
КонецПроцедуры 

#КонецОбласти
